:PROPERTIES:
:ID:       fba29882-1e9f-473f-a128-a2cb7a162a51
:END:
#+title: Org-Mode

* Tutorial

** Links/Hyperlinks

Follows this pattern: =[[LINK][DESCRIPTION]]= 
*** Shortcuts
  Toggle links: =,Tl=
*** References
- [[https://orgmode.org/guide/Hyperlinks.html

** Code blocks
Both = and ~ are used to denote inline code in Org mode.
The difference is that text within = is interpreted verbatim (special characters are not interpreted),
while text within ~ is interpreted as code (special characters like backslashes are interpreted).

- =print("Hello, World!\t")=
- ~print("Hello, World!\t")~

Emacs is much more powerful than markdown and not only can you display a code block with code highlighting but also run it using =C-c C-C= while on the code block
Or course, ensure that after the begin_src block you specify the language.

# use return statement
# Entire source block will get indented and used as the body of main()
#+begin_src python
def foo(x):
  if x>0:
    return x+1

  else:
    return x-1

return foo(5)
#+end_src

#+RESULTS:
: 6

*** References
- [[https://orgmode.org/worg/org-contrib/babel/languages/ob-doc-python.html]]
